Revit 2026 API

# FamilyPointLocation Class

---

Data corresponding to the point locations in certain types of Family Symbols.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyPointLocation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyPointLocation : APIObject
```
```vb
Public Class FamilyPointLocation
	Inherits APIObject
```
```cpp
public ref class FamilyPointLocation : public APIObject
```
```fsharp
type FamilyPointLocation =
    class
        inherit APIObject
    end
```

The FamilyPointLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the corresponding reference point in the Family document. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLocation | Gets the location of the point. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.

#### Reference

Autodesk.Revit.DB Namespace